'''
Дані про температуру води на Чорноморському узбережжі за декаду
вересня зберігаються в масиві. Визначити, скільки за цей час було днів, придатних для
купання.
Виконав : Канюка Р. 122В
'''
while True:
    Data = list()
    #Ввід данних
    while True:
        try:
            for i in range(0,10):
                Data.append(int(input(f'Данні за {i+1} годину : ')))
            break
        except ValueError :
            print('Введіть число!')
    #Знаходжень умови
    itr = 0
    for i in range(0,10):
        n = Data[i]
        # Оптимальна температура для купання 20 - 24 C
        if( n >= 20 and n <= 24 ):
            itr += 1
    print(f'Було {itr} випадки сприятливої температури за декаду')
    quest = input('Завершити програму? Y/N : ')
    if(quest == 'Y' or quest == 'y'):
        break
