'''
Сформуйте лінійний масив дійсних чисел, елементи якого є відстанями,
пройденими тілом при вільному падінні на землю за 1, 2, ..., 10 с.
Виконав : Канюка Р. 122В
'''
while True:
    #Ініціалізація масиву
    X = []
    # Припустимо прискореня вільного падіння(g) дорівнює 10 м/c
    g = 10
    while True:
            try:
                V = int(input('Введіть початкову швидкість : '))
                break
            except ValueError :
                print('Введіть число!')


    #Знаходження результату
    for t in range(1,11):
                X.append(V*t + (g * pow(t,2))/2)
                print(f'За {t} секунду відстань = {X[t-1]}')
    quest = input('Завершити програму? Y/N : ')
    if(quest == 'Y' or quest == 'y'):
        break
