'''
26. Напишіть програму аналізу значень температури хворого за добу:
визначте мінімальне і максимальне значення, середнє арифметичне. Заміри
температури виробляються шість раз на добу і результати вводяться з клавіатури у
масив T.
Виконав : Канюка Р. 122В
'''
import numpy as np
import random
#Методи - заготовки
def userInput(arr, message, numeric):
    '''Ініціалзіцая масиву користувачем.

    Приймає масив , загальне повідомлення , та флажок
    ,що визначає чи є тип елементів масиву дійсними числами.
    '''
    print(message)
    if numeric :
        while True:
            try:
                for i in range(len(arr)):
                    arr[i] = int(input(f'Введіть данні за {i+1} місяць : '))
                break
            
            except ValueError :
                print('Введіть число!')
        return arr
    else :
        for i in range(len(arr)):
            arr[i] = input(f'Введіть данні за {i+1} місяць : ')
        return arr
    
while True:
    #Ініціалізація масиву
    T = userInput(np.empty(6),'Введіть данні температури хворого за добу',True)
    #Знаходження результату
    print(f'''Мінімальне значення : {min(T)}
    \nМаксимальне значення : {max(T)}
    \nСереднє арифметичне : {T.mean()}''')

    quest = input('Завершити програму? Y/N : ')
    if(quest == 'Y' or quest == 'y'):
        break

