Python 3.8.2 (tags/v3.8.2:7b3ab59, Feb 25 2020, 23:03:10) [MSC v.1916 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> 
================ RESTART: C:\Users\kvs1d\Desktop\Covolcium\45.py ===============
Введіть радіус: 19
Опора Довжина
Traceback (most recent call last):
  File "C:\Users\kvs1d\Desktop\Covolcium\45.py", line 24, in <module>
    print(f'{i}    {X[i]}')
NameError: name 'X' is not defined
>>> 
================ RESTART: C:\Users\kvs1d\Desktop\Covolcium\45.py ===============
Введіть радіус: 10
Опора Довжина
0    44.721359549995796
1    45.8257569495584
2    46.9041575982343
3    47.958315233127195
4    48.98979485566356
5    50.0
6    0.0
7    0.0
8    0.0
9    0.0
10    0.0
Завершити програму? Y/N : 
================ RESTART: C:\Users\kvs1d\Desktop\Covolcium\45.py ===============
Введіть радіус: 19
Traceback (most recent call last):
  File "C:\Users\kvs1d\Desktop\Covolcium\45.py", line 20, in <module>
    X[(-1 - i)] , X[i] = R * math.sqrt(25 - (5 - i))
TypeError: cannot unpack non-iterable float object
>>> 
================ RESTART: C:\Users\kvs1d\Desktop\Covolcium\45.py ===============
Введіть радіус: 19
84.97058314499202
87.06893820416096
89.11789943664516
91.12079894294166
93.08061022576076
95.0
Опора Довжина
0    84.97058314499202
1    87.06893820416096
2    89.11789943664516
3    91.12079894294166
4    93.08061022576076
5    95.0
6    93.08061022576076
7    91.12079894294166
8    89.11789943664516
9    87.06893820416096
10    84.97058314499202
Завершити програму? Y/N : 
================ RESTART: C:\Users\kvs1d\Desktop\Covolcium\45.py ===============
Введіть радіус: 10
0
44.721359549995796
1
45.8257569495584
2
46.9041575982343
3
47.958315233127195
4
48.98979485566356
5
50.0
Опора Довжина
0    44.721359549995796
1    45.8257569495584
2    46.9041575982343
3    47.958315233127195
4    48.98979485566356
5    50.0
6    48.98979485566356
7    47.958315233127195
8    46.9041575982343
9    45.8257569495584
10    44.721359549995796
Завершити програму? Y/N : 
================ RESTART: C:\Users\kvs1d\Desktop\Covolcium\45.py ===============
Введіть радіус: 10
0
0.0
1
30.0
2
40.0
3
45.8257569495584
4
48.98979485566356
5
50.0
Опора Довжина
0    0.0
1    30.0
2    40.0
3    45.8257569495584
4    48.98979485566356
5    50.0
6    48.98979485566356
7    45.8257569495584
8    40.0
9    30.0
10    0.0
Завершити програму? Y/N : 
================ RESTART: C:\Users\kvs1d\Desktop\Covolcium\45.py ===============
Введіть радіус: 1
0
0.0
1
3.0
2
4.0
3
4.58257569495584
4
4.898979485566356
5
5.0
Опора Довжина
0     0.0
1     3.0
2     4.0
3     4.58257569495584
4     4.898979485566356
5     5.0
6     4.898979485566356
7     4.58257569495584
8     4.0
9     3.0
10     0.0
Завершити програму? Y/N : 
================ RESTART: C:\Users\kvs1d\Desktop\Covolcium\45.py ===============
Введіть радіус: 10
0
0.0
1
30.0
2
40.0
3
45.8257569495584
4
48.98979485566356
5
50.0
Опора Довжина
1     0.0
2     30.0
3     40.0
4     45.8257569495584
5     48.98979485566356
6     50.0
7     48.98979485566356
8     45.8257569495584
9     40.0
10     30.0
11     0.0
Завершити програму? Y/N : 
================ RESTART: C:\Users\kvs1d\Desktop\Covolcium\45.py ===============
Введіть радіус: 
================ RESTART: C:\Users\kvs1d\Desktop\Covolcium\45.py ===============
Введіть радіус: 10
0
0.0
1
30.0
2
40.0
3
45.8257569495584
4
48.98979485566356
5
50.0
Опора Довжина
1     0.0
2     30.0
3     40.0
4     45.8257569495584
5     48.98979485566356
6     50.0
7     48.98979485566356
8     45.8257569495584
9     40.0
10     30.0
11     0.0
Завершити програму? Y/N : 
================ RESTART: C:\Users\kvs1d\Desktop\Covolcium\45.py ===============
Введіть радіус: 10
0
0.0
1
30.0
2
40.0
3
45.8257569495584
4
48.98979485566356
5
50.0
Опора Довжина
1     0.0
2     30.0
3     40.0
4     45.8257569495584
5     48.98979485566356
6     50.0
7     48.98979485566356
8     45.8257569495584
9     40.0
10     30.0
11     0.0
Завершити програму? Y/N : 
================ RESTART: C:\Users\kvs1d\Desktop\Covolcium\45.py ===============
Введіть радіус: 10
0
0.0
1
30.0
2
40.0
3
45.8257569495584
4
48.98979485566356
5
50.0
Опора Довжина
1     0.0
2     30.0
3     40.0
4     45.8257569495584
5     48.98979485566356
6     50.0
7     48.98979485566356
8     45.8257569495584
9     40.0
10     30.0
11     0.0
Завершити програму? Y/N : 
================ RESTART: C:\Users\kvs1d\Desktop\Covolcium\45.py ===============
Введіть радіус: 10
0
0.0
1
30.0
2
40.0
3
45.8257569495584
4
48.98979485566356
5
50.0
Опора  Довжина
1     0.0
2     30.0
3     40.0
4     45.8257569495584
5     48.98979485566356
6     50.0
7     48.98979485566356
8     45.8257569495584
9     40.0
10     30.0
11     0.0
Завершити програму? Y/N : 