'''
З 8 до 20 години температура повітря вимірювалася щогодини. Відомо,
що протягом цього часу температура знижувалася. Визначте, о котрій годині було
вперше зафіксовано від'ємну температуру.
Виконав : Канюка Р. 122В
'''
while True:
    Data = list()
    #Ініціалізація масиву
    while True:
        try:
            for i in range(8,21):
                Data.append(int(input(f'Данні за {i} годину : ')))
            break
        except ValueError :
            print('Введіть число!')
    #Знаходження результату
    for i in range(8,21):
        if(Data[i - 8] < 0):
            print(f'Температура {Data[i - 8]} стала нижче нуля о {i} годині')
            break
    quest = input('Завершити програму? Y/N : ')
    if(quest == 'Y' or quest == 'y'):
        break
